import './index.css'

export default function ClassicText(props) {
  return (
    <article className="classic-text">
      <section className='center'>
        <h3 className="title">观沧海</h3>
        <address>〔东汉〕曹操</address>
        <p>东临碣石，以观沧海。</p>
        <p>水何澹澹，山岛竦峙。</p>
        <p>树木丛生，百草丰茂。</p>
        <p>秋风萧瑟，洪波涌起。</p>
        <p>日月之行，若出其中；</p>
        <p>星汉灿烂，若出其里。</p>
        <p>幸甚至哉，歌以咏志。</p>
      </section>
      <section>
        <h3>译文</h3>
        <p>东行登上高高的碣石山，来观赏苍茫的大海。</p>
        <p>海水多么宽阔浩荡，海中山岛罗列，高耸挺立。</p>
        <p>周围树木葱茏，各种花草蓬勃茂盛。</p>
        <p>萧瑟的风声传来，草木动摇，海中翻涌着巨大的海浪。</p>
        <p>太阳和月亮升起降落，好像是从这浩瀚的海洋中发出的。</p>
        <p>天河里的灿烂群星，也好像是从大海的怀抱里涌现出来的。</p>
        <p>太值得庆幸了！就用诗歌来表达心志吧。</p>
      </section>
      <section>
        <h3>注释</h3>
        <p>临：登上，有游览的意思。</p>
        <p>
          碣（jié）石：山名。碣石山，河北昌黎碣石山。公元207年秋天，曹操征乌桓得胜回师时经过此地。
        </p>
        <p>
          沧：通“苍”，青绿色。 海：渤海 何：多么 澹澹（dàn
          dàn）：水波摇动的样子。
        </p>
        <p>
          竦峙（sǒng zhì）：耸立。竦 ，通耸，高。 萧瑟：树木被秋风吹的声音。
        </p>
        <p>洪波：汹涌澎湃的波浪 日月：太阳和月亮 若：如同，好像是。</p>
        <p>星汉：银河，天河。 幸：庆幸。 甚：很，程度副词。 至：极点。</p>
        <p>
          幸甚至哉，歌以咏志：太值得庆幸了！就用诗歌来表达心志吧。（最后两句每章都有，与本诗正文的内容没有的直接关系。）
        </p>
      </section>
    </article>
  )
}
